## Plan Result (shareable-lists-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11021871936)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d|3CDBCF7F-D9F6-4417-9BAF-8A6E0C24D2CA" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "3CDBCF7F-D9F6-4417-9BAF-8A6E0C24D2CA" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":769,"Program":"tfcmt","SHA1":"0419ae70352636fd6d20d18c84c85bdcd9887b36","Target":"shareable-lists-api-cdk-production","Vars":{},"WorkflowName":"Shareable Lists API"} -->